In [43]:
!pip install -Uqq numpy pandas
!pip install -Uqq datasets # in HuggingFace

In [2]:
import numpy as np
import pandas as pd
import torch

In [12]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
df = pd.DataFrame(data)

In [13]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [29]:
print(type(df))
print(type(df.state))
print(type(df['year']))
print(type(df.year.map(str)))
print(type(df.iloc(0)))
df['pop'].map(int)

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.indexing._iLocIndexer'>

0    1
1    1
2    3
3    2
4    2
5    3
Name: pop, dtype: int64

In [46]:
df['input'] = 'TEXT1: ' + df.state + '; YEAR1: ' + df.year.map(str) + '; POP1: ' + df['pop'].map(str)

In [39]:
df

    state  year  pop                                  input
0    Ohio  2000  1.5    TEXT1: Ohio; YEAR1: 2000; POP1: 1.5
1    Ohio  2001  1.7    TEXT1: Ohio; YEAR1: 2001; POP1: 1.7
2    Ohio  2002  3.6    TEXT1: Ohio; YEAR1: 2002; POP1: 3.6
3  Nevada  2001  2.4  TEXT1: Nevada; YEAR1: 2001; POP1: 2.4
4  Nevada  2002  2.9  TEXT1: Nevada; YEAR1: 2002; POP1: 2.9
5  Nevada  2003  3.2  TEXT1: Nevada; YEAR1: 2003; POP1: 3.2

In [40]:
df.drop(columns=['input'])

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [ ]:
# test
del df['input']

In [47]:
# import torch.utils.data.dataset
# torch.utils.data.Dataset
# torch.utils.data.dataset.Dataset

from datasets import Dataset, DatasetDict
ds = Dataset.from_pandas(df)

In [48]:
ds

Dataset({
    features: ['state', 'year', 'pop', 'input'],
    num_rows: 6
})

In [1]:
import pandas as pd

# 첫 번째 DataFrame: 직원 정보
data1 = {'ID': ['A01', 'A02', 'A03', 'A04'],
         '이름': ['김철수', '이영희', '박지성', '최민호'],
         '부서': ['영업', '개발', '개발', '마케팅']}
df1 = pd.DataFrame(data1)

# 두 번째 DataFrame: 직원 연봉 정보
data2 = {'ID': ['A01', 'A02', 'A03', 'A05'],
         '연봉': [5000, 7000, 6500, 8000],
         '경력': [3, 7, 6, 9]}
df2 = pd.DataFrame(data2)

print("--- df1 (직원 정보) ---")
print(df1)
print("\n--- df2 (직원 연봉 정보) ---")
print(df2)

--- df1 (직원 정보) ---
    ID   이름   부서
0  A01  김철수   영업
1  A02  이영희   개발
2  A03  박지성   개발
3  A04  최민호  마케팅

--- df2 (직원 연봉 정보) ---
    ID    연봉  경력
0  A01  5000   3
1  A02  7000   7
2  A03  6500   6
3  A05  8000   9

In [2]:
# 'ID' 컬럼을 기준으로 두 DataFrame을 병합 (기본값은 inner join)
merged_inner = pd.merge(df1, df2, on='ID')

print("\n--- Inner Join 결과 ---")
print(merged_inner)

--- Inner Join 결과 ---
    ID   이름  부서    연봉  경력
0  A01  김철수  영업  5000   3
1  A02  이영희  개발  7000   7
2  A03  박지성  개발  6500   6

In [3]:
merged_left = pd.merge(df1, df2, on='ID', how='left')

print("\n--- Left Join 결과 ---")
print(merged_left)

--- Left Join 결과 ---
    ID   이름   부서      연봉   경력
0  A01  김철수   영업  5000.0  3.0
1  A02  이영희   개발  7000.0  7.0
2  A03  박지성   개발  6500.0  6.0
3  A04  최민호  마케팅     NaN  NaN

In [4]:
merged_right = pd.merge(df1, df2, on='ID', how='right')

print("\n--- Right Join 결과 ---")
print(merged_right)

--- Right Join 결과 ---
    ID   이름   부서    연봉  경력
0  A01  김철수   영업  5000   3
1  A02  이영희   개발  7000   7
2  A03  박지성   개발  6500   6
3  A05  NaN  NaN  8000   9

In [5]:
merged_outer = pd.merge(df1, df2, on='ID', how='outer')

print("\n--- Outer Join 결과 ---")
print(merged_outer)

--- Outer Join 결과 ---
    ID   이름   부서      연봉   경력
0  A01  김철수   영업  5000.0  3.0
1  A02  이영희   개발  7000.0  7.0
2  A03  박지성   개발  6500.0  6.0
3  A04  최민호  마케팅     NaN  NaN
4  A05  NaN  NaN  8000.0  9.0